* Heyburrito API

* Endpoints
** Scoreboard given

Get scoreboard given

#+BEGIN_SRC http :pretty
GET http://localhost:1337/heyburrito/scoreboard/given
#+END_SRC

#+RESULTS:
#+begin_example
{
  "error": false,
  "code": 200,
  "message": null,
  "data": [
    {
      "username": "UEHUXHG0G",
      "name": "Stefan",
      "score": 3,
      "avatar": "https://secure.gravatar.com/avatar/1d9ae0f0ee4c6e66ec367005b82b459b.jpg?s=48&d=https%3A%2F%2Fa.slack-edge.com%2F00b63%2Fimg%2Favatars%2Fava_0016-48.png"
    },
    {
      "username": "UEKN9GNAJ",
      "name": "chralp",
      "score": 2,
      "avatar": "https://secure.gravatar.com/avatar/c8facda114a361db902d0cbf6481e819.jpg?s=48&d=https%3A%2F%2Fa.slack-edge.com%2F00b63%2Fimg%2Favatars%2Fava_0006-48.png"
    }
  ]
}
#+end_example

** Scoreboard givers

Get scoreboard givers

#+BEGIN_SRC http :pretty
GET http://localhost:1337/heyburrito/scoreboard/givers
#+END_SRC

#+RESULTS:
#+begin_example
{
  "error": false,
  "code": 200,
  "message": null,
  "data": [
    {
      "username": "UEKN9GNAJ",
      "name": "chralp",
      "score": 5,
      "avatar": "https://secure.gravatar.com/avatar/c8facda114a361db902d0cbf6481e819.jpg?s=48&d=https%3A%2F%2Fa.slack-edge.com%2F00b63%2Fimg%2Favatars%2Fava_0006-48.png"
    }
  ]
}
#+end_example

** Get userstats

Get userstats, append slackUserID

#+BEGIN_SRC http :pretty
GET http://localhost:1337/heyburrito/userstats/UEHUXHG0G
#+END_SRC

#+RESULTS:
#+begin_example
{
  "error": false,
  "code": 200,
  "message": null,
  "data": {
    "user": {
      "username": "UEHUXHG0G",
      "name": "Stefan",
      "score": 3,
      "given": 0,
      "today": 0,
      "avatar": "https://secure.gravatar.com/avatar/1d9ae0f0ee4c6e66ec367005b82b459b.jpg?s=48&d=https%3A%2F%2Fa.slack-edge.com%2F00b63%2Fimg%2Favatars%2Fava_0016-48.png"
    },
    "gived": [],
    "givers": [
      {
        "username": "UEKN9GNAJ",
        "name": "chralp",
        "score": 3,
        "avatar": "https://secure.gravatar.com/avatar/c8facda114a361db902d0cbf6481e819.jpg?s=48&d=https%3A%2F%2Fa.slack-edge.com%2F00b63%2Fimg%2Favatars%2Fava_0006-48.png"
      }
    ]
  }
}
#+end_example

** Histogram

Search in history

*keys*

userId: <slackuserid>, string
startDate: <date>, string
endDate: <date>, string
list: given | givers

none of the keys are requierd.


Example:
#+BEGIN_SRC json

    {
      "userId": "slackUserId",
      "startDate":"2019-01-01",
      "endDate": "2019-02-01",
      "list": "given"
    }


#+END_SRC

#+BEGIN_SRC http :pretty
  POST http://localhost:1337/heyburrito/histogram
  Content-Type: application/json

  {
          "userId": "test"
  }
#+END_SRC

#+RESULTS:
: {}
